{
  "main": {
    "title": "Warum ich?",
    "hello": "kreativer Frontend-Entwickler aus Wiesbaden.",
    "desc-why": "Ich bin ein erfahrener Webdesigner und Entwickler mit einem Auge für Detail und einem starken Gespür für Nutzererfahrung. Mein Ziel ist es, moderne, performante und ästhetisch ansprechende Weblösungen zu entwickeln, die nicht nur gut aussehen, sondern auch funktionieren."
  },
  "skills": {
    "title": "Meine Fähigkeiten",
    "workingOn": "Woran ich gerade arbeite",
    "workingDesc": "Aktuell vertiefe ich meine Kenntnisse in modernen Webtechnologien und Frameworks"
  },
  "testimonials": {
    "title": "Brauchen Sie einen Teamplayer?",
    "subtitle": "Das sagen Kolleg:innen über die Zusammenarbeit mit mir",
    "entries": [
      {
        "name": "Mirkan Polet",
        "role": "Junior Frontend Entwickler",
        "quote": "Die Zusammenarbeit mit Markus an unserem Projekt hat mir riesigen Spaß gemacht. Ich habe enorm viel von Ihn gelernt und würde jederzeit wieder mit ihm ein Projekt starten!",
        "link": "LinkedIn Profil"
      },
      {
        "name": "Simon Fuchs",
        "role": "Junior Frontend Entwickler",
        "quote": "Markus’ fundierte HTML- und CSS-Kenntnisse sowie seine Offenheit für neue Ansätze haben unser Projekt maßgeblich bereichert.",
        "link": "LinkedIn Profil"
      },
      {
        "name": "Sarah Williams",
        "role": "Produktmanagerin bei DesignHub",
        "quote": "Die Zusammenarbeit mit Markus an unserem Projekt hat mir riesigen Spaß gemacht. Ich habe enorm viel von Ihn gelernt und würde jederzeit wieder mit ihm ein Projekt starten!",
        "link": "LinkedIn Profil"
      }
    ]
  },
  "projects": {
    "title": "Meine Projekte",
    "technologies": {
      "title": "Technologien"
    },
    "buttons": {
      "join": "1. Join",
      "elpollo": "2. ElPollo Loco",
      "pokemon-dex": "3. Pokemon-dex"
    },
    "more": "weitere Projekte",
    "join": {
      "title": "Join",
      "about": {
        "title": "Über das Projekt",
        "text": "Diese App ist ein Slack-Klon, der Teamkommunikation und Zusammenarbeit durch eine intuitive Benutzeroberfläche, Echtzeitnachrichten und strukturierte Kanalorganisation revolutioniert."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie halte ich meinen Code sauber und wartbar? Ich habe das Projekt in wiederverwendbare Module und Komponenten aufgeteilt und auf Dokumentation, konsistente Benennung von Dateien, Variablen und Klassen sowie Tests geachtet."
      },
      "team": {
        "title": "Meine Erfahrung in der Teamarbeit",
        "text": "Das Team bestand aus mehreren Mitgliedern. Meine Aufgaben umfassten z. B. Login-Formular, Dashboard und Chat-Funktionalität. Zum Einsatz kamen verschiedene Technologien. Besonders positiv war die gute Zusammenarbeit im Team."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-join.webp",
        "demo": "https://join.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/join"
      }
    },
    "elpollo": {
      "title": "El Pollo Loco",
      "about": {
        "title": "Über das Projekt",
        "text": "El Pollo Loc ist ein browserbasierten Jump’n’Run-Spiels mit HTML5, CSS3 und modernem JavaScript (ES6+), ohne Frameworks. Pepe der Held des Spieles Bewegt sich durch das Level und sammel Münzen und Flaschen ein. Es muss duch springen den verrückten Hühner und kücken ausweichen. Mit den eingesammelten flaschen wird er Endgegner beworfen und hoffentlich getötet."
      },
      "process": {
        "title": "Technische Grundlagen",
        "text": "Darstellung der Spielwelt und aller Objekte (Charaktere, Hintergrund, Gegner)wurde innerhalb der Canvas API realisiert. Per requestAnimationFrame oder setInterval wurden z.B. Bewegungen und Kollisionen realisiert. Das Spiel sollte auch auf kleiner bildschirmen Spielbar sein."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-elpollo.webp",
        "demo": "https://pollo-loco.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/el-pollo-loco"
      }
    },
    "pokemon-dex": {
      "title": "Pokemon Dex",
      "about": {
        "title": "Über das Projekt",
        "text": "Diese Webanwendung bietet ein interaktives Pokédex-Erlebnis. Nutzer können Pokémon durchsuchen, sich per Klick Details anzeigen lassen und durch die Pokémon-Liste navigieren. Die Gestaltung orientiert sich visuell am typischen Pokémon-Stil mit responsive Layout und Overlay-Detailansicht."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Ich strukturiere meine Projekte in wiederverwendbare Module und Komponenten, um Übersicht und Skalierbarkeit zu gewährleisten. Sauberer Code entsteht bei mir durch klare Namenskonventionen, Dokumentation und gezielte Tests."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-pokemon-dex.webp",
        "demo": "https://pokemon-dex.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/pokemon-dex"
      }
    },
    "ccn-umzuege": {
      "title": "CCN Umzüge",
      "about": {
        "title": "Über das Projekt",
        "text": "Diese Plattform ist das Ergebnis eines umfassenden Relaunches für CCN Umzüge. Neben der Modernisierung des Designs stand hier die Funktionalität im Vordergrund: Die Website sollte nicht nur informieren, sondern als interaktives Tool dienen. Durch die Implementierung eines Umzugsgut-Kalkulators wurde die Website von einer reinen Informationsseite zu einem echten Service-Werkzeug für den Endkunden aufgewertet. Die Plattform ist jetzt nicht nur visuell ansprechend, sondern auch intuitiv nutzbar und bietet eine klare Orientierung für Kunden."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie integriere ich komplexe Funktionen benutzerfreundlich? Der Fokus lag auf der Entwicklung einer intuitiven Benutzeroberfläche (UI), insbesondere für den Kalkulator. Ich habe den Prozess so organisiert, dass technische Features nahtlos in das Design eingebettet sind. Durch Konsistenz in der Gestaltung und klare Call-to-Action-Bereiche wird der Nutzer logisch durch die Anfrageprozesse geführt. Auch hier habe ich auf Wartbarkeit geachtet, damit Preisstrukturen im Kalkulator vom Kunden leicht angepasst werden können."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-ccn-1.webp",
        "demo": "https://www.ccnumzuege.de/"
      }
    },
    "falke-facility-managment": {
      "title": "Falke Facility Management",
      "about": {
        "title": "Über das Projekt",
        "text": "Bei diesem Projekt handelte es sich um einen kompletten Relaunch für das Unternehmen Falke Facility Management. Ziel war es, das Dienstleistungsangebot durch ein zeitgemäßes Design und eine klare Informationsarchitektur neu zu positionieren. Die Website dient nun als digitale Visitenkarte, die Professionalität und Vertrauen ausstrahlt und potenzielle Kunden durch eine strukturierte Nutzerführung direkt anspricht."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie verbinde ich technische Performance mit hochwertigem Content?\nDa für dieses Projekt eigens Bilder und Videos produziert wurden, lag ein besonderer Fokus auf der Integration dieser Medien, ohne die Ladezeiten der Website negativ zu beeinflussen. Ich habe den Aufbau der Seite so strukturiert, dass visuelle Elemente und Informationstexte in einer perfekten Balance stehen. Sauberer Code und optimierte Medien-Assets sorgen dafür, dass die Seite auf allen Endgeräten flüssig und performant läuft."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javascript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-ffm1.webp",
        "demo": "https://www.falke-fm.com/"
      }
    },
    "die-fliese": {
      "title": "Die Fliese - Living Bad & Wohnen",
      "about": {
        "title": "Über das Projekt",
        "text": "Dieses Projekt ist ein umfassendes Redesign und Relaunch für das Unternehmen „Die Fliese Living“. Das Ziel war es, den Webauftritt von einer rein informativen, textlastigen Seite in eine moderne, visuelle Erlebniswelt zu verwandeln. Der Fokus liegt nun auf der ästhetischen Präsentation der Materialien: Ein frisches Screendesign rückt die Produkte in den Mittelpunkt und inspiriert den Nutzer durch hochwertige Objektbeispiele."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie stelle ich sicher, dass Design und Technik harmonieren? Ich habe das Projekt ganzheitlich betreut – vom ersten Screendesign bis zur technischen Implementierung in WordPress. Dabei habe ich das Projektmanagement in klare Phasen unterteilt: Konzeption, Design-Entwurf und Entwicklung. Um die Wartbarkeit der Seite zu gewährleisten, habe ich auf eine saubere Strukturierung der WordPress-Installation geachtet, performante Bild-Optimierungen vorgenommen (wichtig für die Ladezeiten der Galerien) und ein intuitives Backend für den Kunden eingerichtet."
      },
      "technologies": {
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javascript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-die-fliese1.webp",
        "demo": "https://diefliese-living.de/"
      }
    },
    "mlz-immobilien": {
      "title": "MLZ Immobilien",
      "about": {
        "title": "Über das Projekt",
        "text": "Der Kunde wünschte sich ein zeitgemäßes Design für seine Website, das auf übermäßige Effekte verzichtet. Daher habe ich mit dezenten Übergängen gearbeitet und das Logo als stilistisches Element etabliert."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie stelle ich sicher, dass Design und Technik harmonieren? Ich habe das Projekt ganzheitlich betreut – vom ersten Screendesign bis zur technischen Implementierung in WordPress. Dabei habe ich das Projektmanagement in klare Phasen unterteilt: Konzeption, Design-Entwurf und Entwicklung. Um die Wartbarkeit der Seite zu gewährleisten, habe ich auf eine saubere Strukturierung der WordPress-Installation geachtet, performante Bild-Optimierungen vorgenommen (wichtig für die Ladezeiten der Galerien) und ein intuitives Backend für den Kunden eingerichtet."
      },
      "technologies": {
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javascript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-mlz1.webp"
      }
    },
    "uebel": {
      "title": "F. Arthur Uebel",
      "about": {
        "title": "Über das Projekt",
        "text": "Für die Marke F. Arthur Uebel wurde der veraltete Internetauftritt umfassend redigiert, um eine moderne Imageseite zu schaffen. Die neue Website sollte die Klarinetten und Künstler klar in den Vordergrund rücken, um das Markenimage stärker und emotionaler darzustellen. Die Umsetzung erfolgte auf Basis von WordPress und WooCommerce, um Flexibilität, Skalierbarkeit und eine einfache Pflege der Plattform zu gewährleisten. Das Projekt umfasste nicht nur die Gestaltung, sondern auch die vollständige Umsetzung und Betreuung vom ersten Gespräch bis zur Live-Veröffentlichung."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie kann eine Imageseite sowohl emotional wirken als auch funktionell sein? Der Fokus lag auf der Schaffung einer klaren, visuellen Struktur, die die Klarinetten und Künstler der Marke F. Arthur Uebel im Zentrum stellt. Ich organisierte den Prozess so, dass die Gestaltung und technische Umsetzung nahtlos aufeinander abgestimmt waren. Durch emotionale Bildsprache, eine klare Navigation und einen intuitiven E-Commerce-Bereich wurde die Benutzererfahrung optimiert. Zudem achtete ich besonders auf Konsistenz in der Gestaltung und die Wartbarkeit der Plattform, um zukünftige Anpassungen durch den Betreiber zu ermöglichen."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-elpollo.webp",
        "demo": "https://pollo-loco.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/el-pollo-loco"
      }
    },
    "widmann": {
      "title": "Widmann Germany",
      "about": {
        "title": "Über das Projekt",
        "text": "Für die Marke Widmann Germany wurde der veraltete Internetauftritt umfassend redigiert, um eine moderne Imageseite mit integrierter Shopfunktion zu schaffen. Die neue Website stand im Fokus, die Produkte klar in den Vordergrund zu rücken und gleichzeitig mehr Emotionen sowie eine stärkere Markendarstellung zu transportieren. Die Umsetzung erfolgte auf Basis von Shopware, um Flexibilität und Skalierbarkeit für zukünftige Anforderungen zu gewährleisten. Das Projekt umfasste nicht nur die Gestaltung, sondern auch die vollständige Umsetzung und Betreuung vom ersten Gespräch bis zur Live-Veröffentlichung."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie kann ein Internetauftritt sowohl emotional wirken als auch funktionell sein? Der Fokus lag auf der Schaffung einer klaren, visuell ansprechenden Website mit Produktschwerpunkt, die sowohl E-Commerce-Funktionen als auch Markenimage stärkt. Ich organisierte den Prozess so, dass die Gestaltung und technische Umsetzung nahtlos aufeinander abgestimmt waren. Durch eine klare Struktur, emotionale Bildsprache und einen intuitiven Bestellprozess wurde die Benutzererfahrung optimiert. Zudem achtete ich besonders auf Konsistenz in der Gestaltung und die Wartbarkeit der Plattform, um zukünftige Anpassungen durch den Betreiber zu ermöglichen."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-elpollo.webp",
        "demo": "https://pollo-loco.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/el-pollo-loco"
      }
    },
    "is-clinical": {
      "title": "Is clinical",
      "about": {
        "title": "Über das Projekt",
        "text": "Für die neue Produktlinie EcoMedic, die Is clinical in ihr Angebot aufgenommen hat, wurde ein Onlineshop auf Basis von Magento CE eingerichtet. Das Projekt beinhaltete die Adaption des B2B-Shops des Herstellers Innovative Skincare, um auf die Anforderungen der neuen Produktlinie abgestimmt zu sein. Neben der technischen Umsetzung standen die Anpassung an die deutsche Rechtssprechung, eine klare Darstellung der Produkte sowie eine optimierte Benutzererfahrung im Vordergrund. Besonders wichtig war, den Bestellprozess so zu gestalten, dass er sowohl für Händler als auch Endkunden intuitiv und effizient ist."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie kann ein B2B-Onlineshop für eine neue Produktlinie sowohl rechtssicher als auch benutzerfreundlich gestaltet werden? Der Fokus lag auf der sorgfältigen Anpassung des bestehenden Shops an die Anforderungen der deutschen Rechtsvorschriften, insbesondere im Bereich des E-Commerce und der Verbraucherschutzgesetze. Ich habe den Prozess so organisiert, dass technische und designbedingte Anpassungen (wie Templates, Produktdetails oder der Bestellprozess) nahtlos in das System integriert wurden. Dabei achtete ich besonders auf Konsistenz in der Gestaltung und klare Aktionen (z. B. „Zur Kasse“, „Produktvergleich“), um den Nutzern eine reibungslose Nutzung zu ermöglichen. Auch die Wartbarkeit des Shops war ein zentrales Ziel, damit zukünftige Anpassungen der Plattform problemlos möglich sind."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-elpollo.webp",
        "demo": "https://pollo-loco.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/el-pollo-loco"
      }
    },
    "haendlerbackend": {
      "title": "Händlerbackend für den Marktplatz Bruchköbel",
      "about": {
        "title": "Über das Projekt",
        "text": "Das Händlerbackend für den Marktplatz der Stadt Bruchköbel wurde mit einem Facelift und einer überarbeiteten User Experience revitalisiert, um attraktiver für lokale Unternehmen zu werden. Ziel war es, die Plattform so zu gestalten, dass sich mehr Händler aus der Region auf dem Marktplatz präsentieren möchten. Neben der visuellen Modernisierung stand die Verbesserung der Bedienbarkeit im Vordergrund, um den Nutzern ein einfacheres und effizienteres Arbeiten zu ermöglichen."
      },
      "process": {
        "title": "So habe ich meinen Arbeitsprozess organisiert",
        "text": "Wie kann ein Händlerbackend intuitiv und nutzerfreundlich gestaltet werden? Der Fokus lag auf der Entwicklung einer klaren Benutzeroberfläche (UI), die für Händler im Alltag leicht verständlich und effizient ist. Ich habe den Prozess so organisiert, dass technische Features wie Formulare oder Datenverarbeitung nahtlos in das Design eingebettet sind. Durch konsistente Gestaltungselemente und klare Aktionen (z. B. „Speichern“, „Zurücksetzen“) wird der Nutzer logisch durch die Anwendungsprozesse geführt. Auch habe ich auf Wartbarkeit geachtet, damit zukünftige Anpassungen der Plattform durch den Betreiber möglich bleiben."
      },
      "technologies": {
        "title": "Technologien",
        "icons": [
          "./assets/images/icons/icon-skills/css-o-font.svg",
          "./assets/images/icons/icon-skills/html-o-font.svg",
          "./assets/images/icons/icon-skills/javasript-o-font.svg",
          "./assets/images/icons/icon-skills/typescript-o-font.svg"
        ]
      },
      "image-links": {
        "image": "./assets/images/projects/screenshot-elpollo.webp",
        "demo": "https://pollo-loco.markusfischer-developer.de",
        "link": "https://github.com/mideasdesign/el-pollo-loco"
      }
    }
  },
  "contact": {
    "title": "So kannst du mich kontaktieren",
    "info": "Ich freue mich auf neue Herausforderungen und spannende Projekte. Meld dich gern. Ich bin offen für frische Impulse, kreative Ansätze oder einfach gute Zusammenarbeit.",
    "emailLabel": "E-Mail",
    "phoneLabel": "Telefon",
    "form": {
      "title": "Schreib mir",
      "name": {
        "label": "Name",
        "placeholder": "Dein Name",
        "error": "Bitte gib deinen Namen ein"
      },
      "email": {
        "label": "E-Mail",
        "placeholder": "deine.email@beispiel.de",
        "error": "Bitte gib eine gültige E-Mail-Adresse ein"
      },
      "subject": {
        "label": "Betreff",
        "placeholder": "Worum geht es?",
        "error": "Bitte gib einen Betreff ein"
      },
      "message": {
        "label": "Nachricht",
        "placeholder": "Deine Nachricht...",
        "error": "Bitte gib eine Nachricht ein"
      },
      "privacy": {
        "text": "Ich habe die",
        "link": "Datenschutzerklärung",
        "error": "Bitte akzeptiere die Datenschutzerklärung",
        "read": "gelesen und akzeptiere sie."
      },
      "submit": "Nachricht senden"
    },
    "success": {
      "title": "Nachricht gesendet!",
      "message": "Vielen Dank für deine Nachricht. Ich werde mich so schnell wie möglich bei dir melden.",
      "close": "Schließen"
    }
  },
  "privacy": {
    "title": "Datenschutzerklärung",
    "sections": {
      "1": {
        "heading": "1. Verantwortliche Stelle",
        "content": {
          "name": "Name: Markus Fischer",
          "address": "Adresse: siehe Impressum",
          "email": "E-Mail: hello[at]markusfischer-developer.de",
          "website": "Webseite: markusfischer-developer.de"
        }
      },
      "2": {
        "heading": "2. Allgemeine Hinweise",
        "text": "Ich nehme den Schutz Ihrer persönlichen Daten sehr ernst. Ihre personenbezogenen Daten werden vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung behandelt."
      },
      "3": {
        "heading": "3. Erhebung und Verarbeitung personenbezogener Daten",
        "text1": "Die Nutzung dieser Website ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf dieser Seite personenbezogene Daten (z. B. Name oder E-Mail-Adresse) erhoben werden, erfolgt dies auf freiwilliger Basis – z. B. über das Kontaktformular.",
        "text2": "Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben."
      },
      "4": {
        "heading": "4. Kontaktformular",
        "text1": "Wenn Sie mir per Kontaktformular Anfragen zukommen lassen, werden Ihre Angaben inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen gespeichert.",
        "text2": "Rechtsgrundlage: Art. 6 Abs. 1 lit. b DSGVO."
      },
      "5": {
        "heading": "5. Server-Log-Dateien",
        "text": "Der Hosting-Provider erhebt und speichert automatisch Informationen in sogenannten Server-Log-Dateien, die Ihr Browser automatisch übermittelt:",
        "list": [
          "Browsertyp und Browserversion",
          "Verwendetes Betriebssystem",
          "Referrer URL",
          "Hostname des zugreifenden Rechners",
          "Uhrzeit der Serveranfrage",
          "IP-Adresse"
        ]
      },
      "6": {
        "heading": "6. Ihre Rechte",
        "text1": "Sie haben jederzeit das Recht auf Auskunft, Berichtigung, Löschung, Einschränkung der Verarbeitung, Datenübertragbarkeit und Widerspruch.",
        "text2": "Zur Ausübung dieser Rechte kontaktieren Sie mich bitte per E-Mail (siehe oben)."
      },
      "7": {
        "heading": "7. SSL- bzw. TLS-Verschlüsselung",
        "text": "Diese Seite nutzt aus Sicherheitsgründen und zum Schutz der Übertragung vertraulicher Inhalte eine SSL- bzw. TLS-Verschlüsselung."
      }
    }
  },
  "nav": {
    "home": "Home",
    "about-me": "Über mich",
    "skills": "Skills",
    "projects": "Projekte",
    "contact": "Kontakt",
    "link_home": "/",
    "link_why_me": "why-me",
    "link_skills": "skills",
    "link_projects": "projects",
    "link_contact": "#contact"
  },
  "hero": {
    "name": "Markus Fischer",
    "title": "Frontend Developer"
  },
  "lang": {
    "de": "DE",
    "en": "EN"
  },
  "legal": {
    "title": "Impressum",
    "section_5": "Angaben gemäß § 5 TMG:",
    "name": "Markus Fischer",
    "address": {
      "street": "Scheffelstr.1",
      "city": "65187 Wiesbaden",
      "country": "Deutschland"
    },
    "contact": "Kontakt:",
    "phone": "Telefon: +49 6119705560",
    "email": "E-Mail: hello[at]markusfischer-developer.de",
    "responsible": "Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV:",
    "same_address": "Anschrift wie oben."
  },
  "footer": {
    "imprint": "Impressum",
    "link-imprint": "impressum",
    "link-privacy": "datenschutz",
    "privacy": "Datenschutz"
  },
  "privacy-page": {
    "title": "Datenschutzerklärung",
    "responsible": {
      "title": "1. Verantwortliche Stelle",
      "name": "Name",
      "address": "Adresse",
      "address_value": "siehe Impressum",
      "email": "E-Mail",
      "website": "Website"
    },
    "general": {
      "title": "2. Allgemeine Hinweise",
      "text": "Ich nehme den Schutz Ihrer persönlichen Daten sehr ernst. Ihre personenbezogenen Daten werden vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung behandelt."
    },
    "collection": {
      "title": "3. Erhebung und Verarbeitung personenbezogener Daten",
      "text1": "Die Nutzung dieser Website ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf dieser Seite personenbezogene Daten (z. B. Name oder E-Mail-Adresse) erhoben werden, erfolgt dies auf freiwilliger Basis – z. B. über das Kontaktformular.",
      "text2": "Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben."
    },
    "contact_form": {
      "title": "4. Kontaktformular",
      "text": "Wenn Sie mir per Kontaktformular Anfragen zukommen lassen, werden Ihre Angaben aus dem Formular inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen bei mir gespeichert.",
      "legal_basis": "Rechtsgrundlage: Art. 6 Abs. 1 lit. b DSGVO."
    },
    "server_logs": {
      "title": "5. Server-Log-Dateien",
      "text": "Der Hosting-Provider erhebt und speichert automatisch Informationen in sogenannten Server-Log-Dateien, die Ihr Browser automatisch übermittelt:",
      "entries": {
        "browser": "Browsertyp und Browserversion",
        "os": "Verwendetes Betriebssystem",
        "referrer": "Referrer URL",
        "hostname": "Hostname des zugreifenden Rechners",
        "time": "Uhrzeit der Serveranfrage",
        "ip": "IP-Adresse"
      }
    },
    "rights": {
      "title": "6. Ihre Rechte",
      "text1": "Sie haben jederzeit das Recht auf Auskunft, Berichtigung, Löschung, Einschränkung der Verarbeitung, Datenübertragbarkeit sowie Widerspruch.",
      "text2": "Zur Ausübung dieser Rechte kontaktieren Sie mich bitte per E-Mail (siehe oben)."
    },
    "encryption": {
      "title": "7. SSL- bzw. TLS-Verschlüsselung",
      "text": "Diese Seite nutzt aus Sicherheitsgründen und zum Schutz der Übertragung vertraulicher Inhalte eine SSL- bzw. TLS-Verschlüsselung."
    }
  }
}
